package project.scene.battle;

import project.scene.DynamicComponent;

public class FieldCellComponent extends DynamicComponent {

	private int value = 0;

	private static final String[][] render = {
			new String[] { "忙式式式式式式式式式式式式式忖", "弛             弛", "弛             弛", "弛             弛",
					"弛             弛", "戌式式式式式式式式式式式式式戎" },
			new String[] { "忙式式式式式式式式式式式式式忖", "弛 瓦 瓦         弛", "弛( 'x')       弛", "弛             弛",
					"弛             弛", "戌式式式式式式式式式式式式式戎" },
			new String[] { "忙式式式式式式式式式式式式式忖", "弛         瓦 瓦 弛", "弛       (-瓦- )弛", "弛             弛",
					"弛             弛", "戌式式式式式式式式式式式式式戎" },
			new String[] { "忙式式式式式式式式式式式式式忖", "弛 瓦 瓦     瓦 瓦 弛", "弛( 'x') (-瓦- )弛", "弛             弛",
					"弛             弛", "戌式式式式式式式式式式式式式戎" },
			new String[] { "忙式式式式式式式式式式式式式忖", "弛             弛", "弛             弛", "弛 瓦 瓦         弛",
					"弛( 6_6)       弛", "戌式式式式式式式式式式式式式戎" },
			new String[] { "忙式式式式式式式式式式式式式忖", "弛 瓦 瓦         弛", "弛( 'x')       弛", "弛 瓦 瓦         弛",
					"弛( 6_6)       弛", "戌式式式式式式式式式式式式式戎" },
			new String[] { "忙式式式式式式式式式式式式式忖", "弛         瓦 瓦 弛", "弛       (-瓦- )弛", "弛 瓦 瓦         弛",
					"弛( 6_6)       弛", "戌式式式式式式式式式式式式式戎" },
			new String[] { "忙式式式式式式式式式式式式式忖", "弛 瓦 瓦     瓦 瓦 弛", "弛( 'x') (-瓦- )弛", "弛 瓦 瓦         弛",
					"弛( 6_6)       弛", "戌式式式式式式式式式式式式式戎" },
			new String[] { "忙式式式式式式式式式式式式式忖", "弛             弛", "弛             弛", "弛         瓦 瓦 弛",
					"弛       (;A; )弛", "戌式式式式式式式式式式式式式戎" },
			new String[] { "忙式式式式式式式式式式式式式忖", "弛 瓦 瓦         弛", "弛( 'x')       弛", "弛         瓦 瓦 弛",
					"弛       (;A; )弛", "戌式式式式式式式式式式式式式戎" },
			new String[] { "忙式式式式式式式式式式式式式忖", "弛         瓦 瓦 弛", "弛       (-瓦- )弛", "弛         瓦 瓦 弛",
					"弛       (;A; )弛", "戌式式式式式式式式式式式式式戎" },
			new String[] { "忙式式式式式式式式式式式式式忖", "弛 瓦 瓦     瓦 瓦 弛", "弛( 'x') (-瓦- )弛", "弛         瓦 瓦 弛",
					"弛       (;A; )弛", "戌式式式式式式式式式式式式式戎" },
			new String[] { "忙式式式式式式式式式式式式式忖", "弛             弛", "弛             弛", "弛 瓦 瓦     瓦 瓦 弛",
					"弛( 6_6) (;A; )弛", "戌式式式式式式式式式式式式式戎" },
			new String[] { "忙式式式式式式式式式式式式式忖", "弛 瓦 瓦         弛", "弛( 'x')       弛", "弛 瓦 瓦     瓦 瓦 弛",
					"弛( 6_6) (;A; )弛", "戌式式式式式式式式式式式式式戎" },
			new String[] { "忙式式式式式式式式式式式式式忖", "弛         瓦 瓦 弛", "弛       (-瓦- )弛", "弛 瓦 瓦     瓦 瓦 弛",
					"弛( 6_6) (;A; )弛", "戌式式式式式式式式式式式式式戎" },
			new String[] { "忙式式式式式式式式式式式式式忖", "弛 瓦 瓦     瓦 瓦 弛", "弛( 'x') (-瓦- )弛", "弛 瓦 瓦     瓦 瓦 弛",
					"弛( 6_6) (;A; )弛", "戌式式式式式式式式式式式式式戎" } };

	protected FieldCellComponent(int locX, int locY, int num) {
		super(locX, locY, 15, 6);

		setCharacter(num);
	}

	public void setCharacter(int num) {
		value = num;
		changeRender(render[num]);
	}

	public void toggleValue(int character) {
		value += (int) Math.pow(2, character - 1);
		setCharacter(value);
	}

}
